# 1.	Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

A= input("введите трехзначное число ")
USER_SUM = int(A[0])+int(A[1])+int(A[2])
USER_MULT = int(A[0])*int(A[1])*int(A[2])

print(USER_SUM)
print(USER_MULT)